TestPlans/Car/Sure Thing! Max/xml/STM3_15102014_9.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xs="http://www.w3.org/2001/XMLSchema">
  <soap:Body>
    <tns:aggregateQuoteRequest xmlns:tns="http://schemas.cdlis.co.uk/aggregator/api/v3-8">
      <userid>CTM</userid>
      <password>tys82HS63BjS</password>
      <broker results="1">hastings-dir</broker>
      <broker results="1">hastings-ess</broker>
      <broker results="1">igi3</broker>
      <broker results="1">onequote</broker>
      <broker results="1">elite</broker>
      <broker results="1">virgin</broker>
      <broker results="1">esurebroker</broker>
      <broker results="1">sheilasbroker</broker>
      <broker results="1">hastings-prem</broker>
      <broker results="1">hastings-peoples</broker>
      <broker results="1">selecter-oyd</broker>
      <broker results="1">sagaselect</broker>
      <broker results="1">smartmiles</broker>
      <broker results="1">castlecover-ageas50</broker>
      <broker results="1">surething</broker>
      <broker results="1">igo4asp-santander</broker>
      <broker results="1">igo4asp-renault</broker>
      <broker results="1">insurewiser</broker>
      <broker results="1">coverbox</broker>
      <broker results="1">drivestyle</broker>
      <broker results="1">sheilaswheelsmd</broker>
      <broker results="1">SureThing-Max</broker>
      <policyType>PC</policyType>
      <returnNoQuotes>Y</returnNoQuotes>
      <store>true</store>
      <risk xsi:type="tns:privateCarRiskType">
        <policy>
          <inceptionDate>2014-11-03</inceptionDate>
          <frequency>A</frequency>
          <protectedBonus>N</protectedBonus>
          <cover>TPO</cover>
          <volXS>0</volXS>
          <restrict>ND</restrict>
          <previousInsurance>
            <expiryDate>2014-11-03</expiryDate>
            <yearsHeld>0</yearsHeld>
            <type>PC</type>
            <noClaimsBonusYears>9</noClaimsBonusYears>
            <ncbProtected>N</ncbProtected>
          </previousInsurance>
          <totalMileage>2000</totalMileage>
          <classOfUse>SDP</classOfUse>
        </policy>
        <proposer driverId="1">
          <name>
            <title>Mr</title>
            <forenames>Ian</forenames>
            <surname>Nine</surname>
          </name>
          <gender>M</gender>
          <dateOfBirth>1973-09-25</dateOfBirth>
          <maritalStatus>S</maritalStatus>
          <residentSince>1973-09-25</residentSince>
          <insuranceRefused>Y</insuranceRefused>
          <nonRtaConviction>Y</nonRtaConviction>
          <fullTimeOccupation>
            <type>H</type>
            <occCode>163</occCode>
            <empCode>186</empCode>
          </fullTimeOccupation>
          <claim claimId="1">
            <code>S008</code>
            <date>2012-04-01</date>
            <cost>0.00</cost>
            <thirdPartyCost>0</thirdPartyCost>
            <fault>Y</fault>
            <personalInjury>Y</personalInjury>
            <thisPolicy>N</thisPolicy>
          </claim>
          <licence>
            <type>E</type>
            <date>2005-10-15</date>
          </licence>
          <vehicleUse>M</vehicleUse>
          <accessToOtherVehicles>NAOV</accessToOtherVehicles>
          <motoringOrg>AA</motoringOrg>
          <smoker>Y</smoker>
          <address>
            <addressLine1>102-104 Hi-Park Centre</addressLine1>
            <addressLine2>High Street</addressLine2>
            <addressLine3>Belfast</addressLine3>
            <addressLine4></addressLine4>
            <postCode>BT1 2JZ</postCode>
            <abodeType>H</abodeType>
          </address>
          <daytimeTelephone>01733345678</daytimeTelephone>
          <eveningTelephone>01733345678</eveningTelephone>
          <email>oliver.neal@emailreaction.org</email>
        </proposer>
        <driver driverId="2">
          <name>
            <title>Mr</title>
            <forenames>Ibrahim</forenames>
            <surname>Nine</surname>
          </name>
          <gender>M</gender>
          <dateOfBirth>1984-02-12</dateOfBirth>
          <maritalStatus>V</maritalStatus>
          <residentSince>1984-02-12</residentSince>
          <insuranceRefused>Y</insuranceRefused>
          <nonRtaConviction>Y</nonRtaConviction>
          <fullTimeOccupation>
            <type>E</type>
            <occCode>60B</occCode>
            <empCode>077</empCode>
          </fullTimeOccupation>
          <claim claimId="2">
            <code>O001</code>
            <date>2011-04-01</date>
            <cost>500.00</cost>
            <thirdPartyCost>0</thirdPartyCost>
            <fault>Y</fault>
            <personalInjury>N</personalInjury>
            <thisPolicy>N</thisPolicy>
          </claim>
          <licence>
            <type>E</type>
            <date>2010-10-15</date>
          </licence>
          <vehicleUse>F</vehicleUse>
          <accessToOtherVehicles>NAOV</accessToOtherVehicles>
          <relationshipToProposer>N</relationshipToProposer>
        </driver>
        <vehicle>
          <regNumber>AK05VNH</regNumber>
          <abiCode>31520102</abiCode>
          <yearOfManufacture>2005</yearOfManufacture>
          <whereKept>R</whereKept>
          <keeper>N</keeper>
          <owner>Leased</owner>
          <purchased>2013-02-01</purchased>
          <value>5000</value>
          <paid>5000</paid>
          <vehicleOthers>0</vehicleOthers>
          <LHD>N</LHD>
          <ABS>N</ABS>
          <seats>3</seats>
          <modifications>
            <modified>N</modified>
          </modifications>
          <immob>FACT</immob>
          <alarm>FACT</alarm>
          <tracker>NONE</tracker>
        </vehicle>
        <duqs>
          <question number="11">N</question>
          <question number="15">N</question>
          <question number="190">2005</question>
          <question number="266">M</question>
          <question number="40">HOME</question>
          <question number="579" />
          <question number="580"></question>
          <question number="578">N</question>
          <question number="282">I</question>
          <question number="527">Y</question>
          <question number="675">N</question>
          <question number="544">N</question>
        </duqs>
      </risk>
      <brokerOptionalExtensions>
        <brokerOptionalExtension>
          <type>Premier Mandatory Bundle</type>
        </brokerOptionalExtension>
      </brokerOptionalExtensions>
    </tns:aggregateQuoteRequest>
  </soap:Body>
</soap:Envelope>